## Plan Result (aat_global)




<pre><code>Plan: 10 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;idam-web-public-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;idam-web-public-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;idam-web-public-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;idam-web-public-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;idam-web-public-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;idam-web-public-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;idam-web-public-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;idam-web-public-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;idam-web-public-staging&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;idam-web-public-staging&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;probate&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["idam-web-public-staging"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Cdn/profiles/hmcts-aat"
      + expiration_date          = (known after apply)
      + host_name                = "idam-web-public-staging.aat.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "idam-web-public-staging"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["idam-web-public-staging"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["idam-web-public-staging"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["idam-web-public-staging"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "idamwebpublicstagingaatPremium"
      + resource_group_name   = "lz-aat-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "client_id"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "client_id"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "scope"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "description"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtCookie"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtLatC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtPC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxVisitor"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxvt"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookies_policy"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookies_preferences_set"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "seen_cookie_message"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "Idam.AuthId"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "Idam.Session"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "jwt"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "label"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "oauth2ClientSecret"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "password"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "username"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "email"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "redirect_uri"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "redirect_uri"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "redirectUri"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "redirectUri"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "referer"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "refresh_token"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "refresh_token"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "response_type"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "scope"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "state"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "token"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "token"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "Idam.SSOSession"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "session_state"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "nonce"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "post_logout_redirect_uri"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "id_token_hint"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code_challenge"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "code_challenge"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "code_verifier"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["probate"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/probateaatPremium"
      ~ mode                              = "Detection" -> "Prevention"
        name                              = "probateaatPremium"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["idam-web-public-staging"] will be created
  + resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "idam-web-public-staging"
      + origin_host_header             = "idam-web-public-staging.aat.platform.hmcts.net"
      + priority                       = 1
      + weight                         = 50
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group["idam-web-public-staging"] will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Cdn/profiles/hmcts-aat"
      + id                                                        = (known after apply)
      + name                                                      = "idam-web-public-staging"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + load_balancing {
          + additional_latency_in_milliseconds = 0
          + sample_size                        = 4
          + successful_samples_required        = 2
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["idam-web-public-staging"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Cdn/profiles/hmcts-aat/afdEndpoints/hmcts-aat"
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpOnly"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "idam-web-public-staging"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Https",
        ]

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "UseQueryString"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["idam-web-public-staging"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Cdn/profiles/hmcts-aat/afdEndpoints/hmcts-aat"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Cdn/profiles/hmcts-aat/originGroups/defaultBackend"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Cdn/profiles/hmcts-aat/originGroups/defaultBackend/origins/defaultBackend",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Cdn/profiles/hmcts-aat/ruleSets/httpsredirect",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "idam-web-public-stagingHttpsRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["idam-web-public-staging"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Cdn/profiles/hmcts-aat"
      + id                       = (known after apply)
      + name                     = "idamwebpublicstagingaatPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["idam-web-public-staging"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.idam-web-public-staging"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "aat.platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Cdn/profiles/hmcts-aat|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 10 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2012,"Program":"tfcmt","SHA1":"","Target":"aat_global","Vars":{}} -->